{
  "帮助": {
    "匹配":{
      "匹配方法选择":"用于以何种方式去寻找需要点击或者其他行为的算法。",
      "图片名": "图片的名字，无需后缀，它不能重复。",
      "图片名二": "图片的名字，无需后缀，它不能重复。图片是用查看的，名字是为了以后好回忆是做什么用的。",
      "X轴": "X轴上的坐标，默认是给截取的图片X轴的中心点。",
      "Y轴":  "Y轴上的坐标，默认是给截取的图片Y轴的中心点。",
      "范围": "截取范围是左上和右下的坐标，格式：x1 y1 x2 y2，用空格隔开，x1和y1是搜索时的起始位置，可以是整数（包括负数，意味着反过来加减）和分数，分数意味着按照模拟器屏幕大小的百分比进行计算。也可以直接使用参数值，参数值是根据截图时大小向外扩了200像素。",
      "算法": "匹配时使用的算法类型，公式可以在opencv里面看，使用该数值即可。",
      "最低相似度": "相似度太低可能会导致匹配错误的位置，太高可能匹配不到，0.8是常用数字。",
      "额外补充": "0表示不会触发增加使用图片之间结构相似度算法。1表示会使用，建议0。它可以在图片内容相同，但颜色不同时做出正确的匹配。",
      "阈值": "用于将图片二值化的阈值，0-255之间。",
      "X偏移": "可以是负数，但必须是整数，两次匹配，第一次定位，公式：左上角x+预先截图的宽度+X偏移。必须要注意偏移的范围包含了后编码的图片，不然可能匹配不到。",
      "Y偏移": "可以是负数，但必须是整数，两次匹配，第一次定位，公式：左上角y+预先截图的高度+Y偏移。必须要注意偏移的范围包含了后编码的图片，不然可能匹配不到。",
      "编码": "图片匹配或者二值图片匹配的编码，是字母加数字的组合，填写时可以查看具体的序号。",
      "前编码": "第一次匹配用的编码，这个编码是其他匹配类型的编码，例如A10。",
      "后编码": "第二次匹配用的编码，可以和前编码是同一种匹配方式，也可以不同。",
      "分类": "训练是根据每种类别分开训练的，你可以后续在相同的类别里面添加图片。再次训练，这样会把一起的图片一起加进来训练。",
      "轮回数": "训练一遍意味着把所有的图片和标签训练了一遍，之后又会重复相同的操作，这样的操作的次数就是轮回次数。160次是个不错的次数。",
      "置信度": "和相似度类似，低于的就算错误，高于的才算是要找的分类。相同分类下，用来训练的物体越接近可以越高，物体差别越大则越低。",
      "阈值类型": "一种计算阈值的算法，这里是默认0即可，把图片灰度之后再选择留下的颜色。具体情况需要查看opencv的算法才能明白。这些算法是非常容易理解"
    },
    "步骤":{
      "文件名": "可以随便一个和步骤组合相关的名字，请不要不要重复，这会导致原文件数据丢失。",
      "名称":"随便的名称，但最好是中文，且不要重复。在开头加*号来避免没有找到就退出任务的逻辑。",
      "界面编码":"由匹配方法的编码，加具体的序号，例如A10，表示匹配方法.csv的序号为10的那条数据。可以为空。A是图片匹配方法。也可以是其他方法。",
      "方法编码":"和界面编码相同。找到后会直接执行行为编码的行动。",
      "行为编码":"执行某个动作，A表示点击，B表示滚动(例如：B150Y，数字是滑动量，X表示延宽滑动量，正数表示从左往右划，负数表示从右往左划，Y表示延高滑动量，正数表示手指由上到下，负数表示由下到上，可以是负数，如果X和Y都没有)。C是返回按钮，D是回到主界面的按钮，E是长按例如：E1.5，1.5表示1.5秒。可以为空，意味着不执行任何动作。它只会在有方法编码的前提下才会触发。",
      "动后编码":"例如A1Z0；前面A1和界面编码相同，后面Z表示找到了，0表示无限次循环，也可以是其它数字，找到了就继续循环直到没找到为止，在这期间它会重复执行行为编码的行为，直到找不到为止。但它还可以是J，表示没有找到就继续循环、执行行为。可以为空。",
      "循环次数":"循环多少次，如果没有找到就会循环，0表示无限次，次数用尽没找到会退出当前任务。可以在名称前面加*号来避免。",
      "循环间隔":"每次循环间隔多久，单位是秒。必须要有一个时间，不然可能会飞速的让你电脑卡机！！！"
    },
    "任务":{
      "文件名": "可以随便名字，你能明白它是什么任务就行，请不要不要重复，这会导致原文件数据丢失。",
      "名称":"它只能是步骤文件名。",
      "编号":"文件内步骤对应的序号，如果是0表示整个文件是一个步骤组，会从第一个步骤执行到最后一个步骤。",
      "是":"表示成功执行后需要前往的序号，该序号是任务里的序号。-1表示立即停止整个任务，0表示从头开始执行任务，大于零的数字表示具体的序号步骤。请注意它可能会导致无限循环！！！所以一定要小心让大的序号跳转到小的序号上。",
      "否":"表示成功失败后需要前往的序号，该序号是任务里的序号。-1表示立即停止整个任务，0表示从头开始执行任务，大于零的数字表示具体的序号步骤。请注意它可能会导致无限循环！！！所以一定要小心让大的序号跳转到小的序号上。"
    },
    "图片":{
      "自动":"开启将在新步骤提交后，自动进行一次测试执行。"
    },
    "拖动分类":{
      "原始":"原始任务来源于执行端任务间的任务文件，它可以拖拽到每天、每周、每月任务列表中。“拖过去的时候最好朝放置区域的上半部分放”。按住ctrl可以多选。",
      "每天":"可以从原始任务中拖动到此处，之后会立即额外加入到今日任务中。删除后会同时删除今日任务中相应的任务。",
      "每周":"可以从原始任务中拖动到此处，之后会判断今日是周几，然后选择性的加入到今日表中。数字是0-6，表示周天到周六，0表示星期天，告诉程序你要每周几执行。删除后会同时删除今日任务中相应的任务。",
      "每月":"可以从原始任务中拖动到此处，之后会判断今日是几号，然后选择性的加入到今日表中。数字是1-31，表示每月几号执行。删除后会同时删除今日任务中相应的任务。",
      "今日":"可从每天，每周，每月任务中直接拖入，直接意味着它是一个临时任务，第二天将不在出现。它可以上下拖动，用于改变执行顺序。任务可以删除。",
      "删除":"除原始任务外都可以拖到这里来删除。"
    },
    "表格":{
      "自动":"开启将在输入框失去焦点后，自动保存到执行端。"
    }
  },
  "提示":{
    "多图处理":{
      "截屏次数":"截屏次数，这次需要截取多少张图片。",
      "间隔":"间隔，每次截屏间隔。",
      "同区连剪":"会在选中区域中同时对多张截屏裁剪相同的区域，查看结果时需要在不同截屏下查看。"
    }
  }
}